Revit 2027 API
ParameterTypeId.RebarShapeHookStyle Property
 "Style"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarShapeHookStyle { get; }
Public Shared ReadOnly Property RebarShapeHookStyle As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarShapeHookStyle {
	ForgeTypeId^ get ();
}
static member RebarShapeHookStyle : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace